driver-tests/bpelse/assign/AssignJbi/test/echoNonNegativeIntegerDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:item xmlns:msgns="http://stc.com/echoNonNegativeIntegerDataType" xmlns:ns1="http://stc.com/echoNonNegativeIntegerDataType">
      <ns1:string>200</ns1:string>
      <ns1:normalizedString>200</ns1:normalizedString>
      <ns1:token>200</ns1:token>
      <ns1:base64Binary>200</ns1:base64Binary>
      <ns1:hexBinary>200</ns1:hexBinary>
      <ns1:integer>200</ns1:integer>
      <ns1:positiveInteger>200</ns1:positiveInteger>
      <ns1:nonNegativeInteger>200</ns1:nonNegativeInteger>
      <ns1:nonPositiveInteger>200</ns1:nonPositiveInteger>
      <ns1:long>200</ns1:long>
      <ns1:unsignedLong>200</ns1:unsignedLong>
      <ns1:int>200</ns1:int>
      <ns1:unsignedInt>200</ns1:unsignedInt>
      <ns1:short>200</ns1:short>
      <ns1:unsignedShort>200</ns1:unsignedShort>
      <ns1:byte>200</ns1:byte>
      <ns1:unsignedByte>200</ns1:unsignedByte>
      <ns1:decimal>200</ns1:decimal>
      <ns1:float>200</ns1:float>
      <ns1:double>200</ns1:double>
      <ns1:boolean>200</ns1:boolean>
      <ns1:duration>200</ns1:duration>
      <ns1:dateTime>200</ns1:dateTime>
      <ns1:date>200</ns1:date>
      <ns1:time>200</ns1:time>
      <ns1:gYear>200</ns1:gYear>
      <ns1:gYearMonth>200</ns1:gYearMonth>
      <ns1:gMonth>200</ns1:gMonth>
      <ns1:gMonthDay>200</ns1:gMonthDay>
      <ns1:gDay>200</ns1:gDay>
      <ns1:Name>200</ns1:Name>
      <ns1:QName>200</ns1:QName>
      <ns1:NCName>200</ns1:NCName>
      <ns1:anyURI>200</ns1:anyURI>
      <ns1:language>200</ns1:language>
      <ns1:ID>200</ns1:ID>
      <ns1:IDREF>200</ns1:IDREF>
      <ns1:IDREFS>200</ns1:IDREFS>
      <ns1:ENTITY>200</ns1:ENTITY>
      <ns1:ENTITIES>200</ns1:ENTITIES>
      <ns1:NMTOKEN>200</ns1:NMTOKEN>
      <ns1:NMTOKENS>200</ns1:NMTOKENS>
    </ns1:item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
